<unk>
<blank>
<s>
</s>
)
(
;
.
VAR_1
}
{
METHOD_1
,
VAR_2
TYPE_1
public
METHOD_2
void
=
return
VAR_3
METHOD_3
TYPE_2
java.lang.String
STRING_1
int
this
if
new
null
VAR_4
METHOD_4
>
<
private
boolean
TYPE_3
+
0
static
true
false
]
[
throws
==
STRING_2
final
protected
:
!=
1
VAR_5
INT_1
super
METHOD_5
get
java.lang.System.out.println
i
else
long
-
java.util.List
value
id
name
java.lang.Exception
add
double
TYPE_4
android.view.View
!
java.lang.Object
?
for
position
context
try
result
java.io.IOException
size
view
class
catch
toString
android.content.Intent
key
&&
x
VAR_6
data
intent
index
throw
event
message
float
args
remove
java.lang.Integer
STRING_3
equals
METHOD_6
y
java.util.ArrayList
length
*
++
start
item
synchronized
setText
c
type
show
||
put
case
INT_2
p
assertEquals
/
main
t
java.io.File
b
update
getName
path
response
node
byte
set
java.lang.Long
info
isEmpty
+=
execute
n
a
error
TYPE_5
getActivity
init
getId
state
list
file
contains
android.content.Context
getString
url
msg
text
listener
java.util.Map
FLOAT_1
>=
values
VAR_7
...
java.lang.Throwable
java.util.Date
status
count
getValue
getText
while
instanceof
java.lang.Boolean
getContext
switch
query
append
java.lang.Class
<=
target
STRING_4
build
java.util.Set
title
java.lang.Double
params
time
format
height
out
delete
str
date
f
element
break
setEnabled
obj
extends
assertTrue
METHOD_7
source
java.lang.Thread
replace
java.lang.Void
output
java.util.Collection
--
content
native
offset
string
number
INT_3
java.lang.String.format
end
compareTo
field
getClass
commit
buffer
temp
char
token
min
CHAR_1
%
line
VAR_8
handle
setValue
substring
java.lang.Integer.parseInt
fileName
sum
array
java.util.HashMap
j
java.util.Arrays.asList
default
abstract
label
assert
method
filename
toLowerCase
STRING_5
num
-=
|
writer
getType
arg
getTime
TYPE_6
split
getData
parameters
to
java.util.Random
java.lang.NullPointerException
&
assertThat
open
java.lang.CharSequence
k
first
param
finally
trim
java.lang.System.out.print
counter
java.lang.StringBuilder
0.0
results
getInt
assertNotNull
replaceAll
java.lang.System.err.println
java.lang.Float
answer
"\n"
iterator
startTime
java.io.InputStream
getView
getBoolean
java.lang.System.exit
filePath
short
getIntent
1.0
step
VAR_9
java.util.HashSet
java.lang.Integer.toString
fieldName
tmp
java.net.URL
FLOAT_2
0.0F
METHOD_8
setState
className
fail
STRING_6
java.awt.Color
src
java.util.Properties
java.lang.Math.abs
java.util.Scanner
expr
buf
INT_4
java.util.Calendar
java.lang.ClassNotFoundException
startsWith
getColor
endTime
"0"
intValue
java.util.LinkedList
java.util.Map.Entry
pattern
keys
String
nodes
1.0F
select
java.util.Collections.sort
java.lang.Math.round
1L
var
java.util.Iterator
function
CHAR_2
0L
"id"
java.lang.Math.random
toUpperCase
op
getConfig
errors
"name"
words
java.util.Calendar.getInstance
VAR_10
TYPE_7
"true"
java.lang.Long.parseLong
STRING_7
operation
java.lang.Math.pow
attribute
rows
*=
java.lang.StringBuffer
out.write
java.util.Vector
java.io.FileInputStream
INT_5
java.io.BufferedReader
do
args.length
^
METHOD_9
FLOAT_3
&=
names
diff
VAR_11
org.testng.Assert.assertEquals
STRING_8
java.io.FileOutputStream
getSelection
"false"
|=
~
java.io.FileWriter
java.awt.Font
android.widget.Button
android.widget.LinearLayout
TYPE_8
java.util.regex.Matcher
java.util.logging.Logger.getLogger
addComponent
VAR_12
CHAR_3
writer.write
java.io.BufferedWriter
STRING_9
NULL
java.io.FileReader
^=
stringBuilder.append
not
continue
INT_6
"type"
VAR_13
STRING_10
%=
"\t"
VAR_14
STRING_11
METHOD_10
FLOAT_4
CHAR_4
TYPE_9
INT_7
FLOAT_5
<<=
/=
VAR_15
TYPE_11
TYPE_10
FLOAT_6
VAR_17
VAR_16
TYPE_14
TYPE_13
TYPE_12
STRING_14
STRING_13
STRING_12
METHOD_11
INT_8
FLOAT_9
FLOAT_8
FLOAT_7
FLOAT_10
CHAR_7
CHAR_6
CHAR_5
>>>=
>>=
<EOT>
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54