)
(
;
VAR_1
.
}
{
METHOD_1
,
VAR_2
public
TYPE_1
void
METHOD_2
return
=
VAR_3
java.lang.String
METHOD_3
TYPE_2
if
null
int
this
new
STRING_1
<
>
VAR_4
METHOD_4
private
boolean
0
static
TYPE_3
!=
false
true
==
throws
]
[
+
1
final
protected
super
:
VAR_5
get
STRING_2
INT_1
METHOD_5
i
-
value
long
else
id
java.util.List
name
double
?
android.view.View
java.lang.Object
!
java.lang.Exception
add
position
context
size
&&
result
for
TYPE_4
view
java.io.IOException
key
java.lang.System.out.println
index
toString
x
try
android.content.Intent
class
data
message
remove
float
args
event
equals
catch
java.lang.Integer
synchronized
VAR_6
length
intent
y
java.util.ArrayList
start
item
type
++
*
||
c
STRING_3
METHOD_6
throw
p
isEmpty
update
put
b
setText
main
set
t
assertEquals
case
java.io.File
path
getName
node
/
java.lang.Long
response
byte
INT_2
>=
contains
init
n
list
execute
+=
error
getId
android.content.Context
state
file
a
text
show
url
listener
java.util.Map
values
info
getActivity
msg
getString
TYPE_5
java.lang.Throwable
...
java.util.Date
getValue
status
<=
count
query
getText
VAR_7
delete
while
title
java.lang.Boolean
time
java.lang.Class
target
instanceof
append
FLOAT_1
java.util.Set
java.lang.Double
date
obj
switch
params
build
str
height
element
format
f
getContext
out
break
source
offset
setEnabled
toLowerCase
STRING_4
assertTrue
extends
java.util.Collection
java.lang.Void
--
end
output
compareTo
trim
number
content
temp
string
min
buffer
field
METHOD_7
replace
commit
abstract
token
char
java.lang.String.format
INT_3
java.util.HashMap
java.lang.Thread
array
handle
%
fileName
java.lang.Integer.parseInt
VAR_8
line
substring
java.util.Arrays.asList
label
getClass
sum
default
setValue
CHAR_1
method
getTime
j
parameters
filename
arg
num
getType
getData
-=
assert
"\n"
java.lang.CharSequence
split
writer
param
java.lang.StringBuilder
open
assertNotNull
finally
java.lang.Math.abs
java.util.Random
java.util.HashSet
first
0.0
assertThat
STRING_5
k
filePath
to
iterator
java.lang.NullPointerException
&
TYPE_6
startTime
results
java.lang.System.exit
getInt
counter
1.0
java.io.InputStream
java.lang.Integer.toString
java.lang.Float
answer
getView
short
|
step
java.lang.System.out.print
className
toUpperCase
tmp
replaceAll
"0"
fieldName
setState
getBoolean
native
java.net.URL
0.0F
1.0F
VAR_9
src
java.util.LinkedList
getIntent
expr
buf
java.util.Calendar
java.lang.System.err.println
java.util.Properties
java.awt.Color
METHOD_8
endTime
FLOAT_2
startsWith
java.util.Scanner
java.util.Collections.sort
0L
java.util.Iterator
java.lang.ClassNotFoundException
STRING_6
INT_4
pattern
keys
intValue
getColor
java.util.Map.Entry
java.lang.Math.round
java.lang.Long.parseLong
fail
"name"
var
select
nodes
1L
java.util.Calendar.getInstance
op
getConfig
function
errors
org.testng.Assert.assertEquals
java.lang.Math.random
words
rows
operation
attribute
VAR_10
String
*=
"id"
out.write
java.util.Vector
TYPE_7
CHAR_2
"true"
names
java.lang.Math.pow
STRING_7
java.io.FileInputStream
args.length
|=
java.io.BufferedReader
do
METHOD_9
INT_5
"false"
stringBuilder.append
getSelection
java.io.FileOutputStream
VAR_11
java.io.FileWriter
diff
^
FLOAT_3
&=
java.io.BufferedWriter
STRING_8
~
java.lang.StringBuffer
java.awt.Font
addComponent
NULL
continue
"type"
java.util.regex.Matcher
android.widget.Button
VAR_12
TYPE_8
CHAR_3
not
writer.write
java.io.FileReader
^=
STRING_9
STRING_10
VAR_13
INT_6
"\t"
java.util.logging.Logger.getLogger
VAR_14
STRING_11
CHAR_4
%=
android.widget.LinearLayout
TYPE_9
METHOD_10
FLOAT_5
FLOAT_4
>>=
<<=
/=
VAR_15
TYPE_11
TYPE_10
VAR_17
VAR_16
TYPE_14
TYPE_13
TYPE_12
STRING_14
STRING_13
STRING_12
METHOD_11
FLOAT_6
CHAR_7
CHAR_6
CHAR_5
>>>=
